3.Create and fill 2 tables exactly like those below (you will need this script in the exam as well).
Write a query: output the Department_name which has the longest-working employee in the company, together with the First_name + Last_name of this employee.

In [2]:
%load_ext sql
%sql postgresql://reader:Miba2021@10.129.0.25:5432/demo

In [5]:
%%sql
DROP TABLE IF EXISTS public.Departments;

CREATE TABLE public.Departments (
    DEPARTMENT_ID INT PRIMARY KEY,
    DEPARTMENT_NAME VARCHAR(50),
    MANAGER_ID INT
);

 * postgresql://reader:***@10.129.0.25:5432/demo
Done.
Done.

[]

In [6]:
%%sql
INSERT INTO Departments (DEPARTMENT_ID, DEPARTMENT_NAME, MANAGER_ID) VALUES
(10, 'Administration', 200),
(30, 'Purchasing', 114),
(40, 'HumanResources', 203),
(50, 'Shipping', 121),
(60, 'IT', 103),
(70, 'PublicRelations', 204),
(80, 'Sales', 145),
(90, 'Executive', 100),
(100, 'Finance', 108),
(110, 'Accounting', 205);

 * postgresql://reader:***@10.129.0.25:5432/demo
10 rows affected.

[]

In [8]:
%%sql
CREATE TABLE IF NOT EXISTS public.Employees (
    EMPLOYEE_ID INT PRIMARY KEY,
    FIRST_NAME VARCHAR(50),
    LAST_NAME VARCHAR(50),
    HIRE_DATE DATE,
    JOB_ID VARCHAR(10),
    MANAGER_ID INT,
    DEPARTMENT_ID INT,
    FOREIGN KEY (DEPARTMENT_ID) REFERENCES public.Departments(DEPARTMENT_ID)
);

 * postgresql://reader:***@10.129.0.25:5432/demo
Done.

[]

In [9]:
%%sql
INSERT INTO Employees (EMPLOYEE_ID, FIRST_NAME, LAST_NAME, HIRE_DATE, JOB_ID, MANAGER_ID, DEPARTMENT_ID) VALUES
(100, 'Steven', 'King', '1987-06-17', 'AD_PRES', NULL, 90),
(101, 'Neena', 'Kochhar', '1987-06-18', 'AD_VP', 100, 90),
(102, 'Lex', 'DeHaan', '1987-06-19', 'AD_VP', 100, 90),
(103, 'Alexander', 'Hunold', '1987-06-20', 'IT_PROG', 102, 60),
(107, 'Diana', 'Lorentz', '1987-06-21', 'IT_PROG', 103, 60),
(108, 'Nancy', 'Greenberg', '1987-06-22', 'FI_MGR', 101, 100),
(109, 'Daniel', 'Faviet', '1987-06-26', 'FI_ACCOUNT', 108, 100),
(114, 'Den', 'Raphaely', '1987-06-24', 'PU_MAN', 100, 30),
(118, 'Guy', 'Himuro', '1987-07-05', 'PU_CLERK', 114, 30),
(119, 'Peter', 'Vargas', '1987-07-31', 'ST_CLERK', 114, 30),
(134, 'John', 'Russell', '1987-08-01', 'SA_MAN', 100, 80),
(146, 'Karen', 'Partners', '1987-08-02', 'SA_MAN', 100, 80);

 * postgresql://reader:***@10.129.0.25:5432/demo
12 rows affected.

[]

Write a query: output the Department_name which has the longest-working employee in the company, together with the First_name + Last_name of this employee.

In [11]:
%%sql
SELECT d.DEPARTMENT_NAME,
       CONCAT(e.FIRST_NAME, ' ', e.LAST_NAME) AS EMPLOYEE_NAME
FROM Employees e
JOIN Departments d ON e.DEPARTMENT_ID = d.DEPARTMENT_ID
WHERE e.HIRE_DATE = (SELECT MIN(HIRE_DATE) FROM Employees);

 * postgresql://reader:***@10.129.0.25:5432/demo
1 rows affected.

[('Executive', 'Steven King')]